Public Attributes | List of all members
API_OverrideCombination Struct Reference
Graphic Overrides
Represents a combination of override rules with a name. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_Guid  | guid
The unique identifier of the combination.
GS::UniString  | name
The name of the combination, that is unique within its project.
Detailed Description
Represents a combination of override rules with a name.
Member Data Documentation
◆ guid
 API_OverrideCombination::guid
The unique identifier of the combination.
◆ name
 API_OverrideCombination::name
The name of the combination, that is unique within its project.